#### Terraform Plan 📖`success`
#### `Plan: 36 to add, 22 to change, 1 to destroy.`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Stromweld/tf_repo_manager/runs/run-br1FNvQnncKmCHus

Waiting for the plan to start...

Terraform v1.13.4
on linux_amd64
Initializing plugins and modules...
tfe_oauth_client.github: Refreshing state... [id=oc-My3Z8GgnzemkfQKc]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_repository.this: Refreshing state... [id=tf_repo_manager]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this: Refreshing state... [id=terraform-github-repositories]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-private-modules]
module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["github-org-collaborators"].module.repository.github_repository.this: Refreshing state... [id=github-org-collaborators]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["kickstart"].module.repository.github_repository.this: Refreshing state... [id=kickstart]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_repository.this: Refreshing state... [id=chef_base_role]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_repository.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_repository.this: Refreshing state... [id=chef_automate_ha]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_collectd_ii]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Reading...
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.data.github_branch.main: Read complete after 1s [id=tf_repo_manager:main]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Read complete after 2s [id=terraform-tfe-private-modules:main]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-github-repositories:TOKEN_TFC]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-workspaces:TOKEN_TFC]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-private-modules:TOKEN_TFC]
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["github-org-collaborators"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Read complete after 1s [id=terraform-github-repositories:main]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_default.this: Refreshing state... [id=tf_repo_manager]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Read complete after 0s [id=terraform-tfe-workspaces:main]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHSeHTM4Bh7gF]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Read complete after 1s [id=kickstart:main]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Read complete after 1s [id=aws_temp_saml_creds:main]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Read complete after 1s [id=Chef_AD_DNS_Solarwinds_Spacewalk:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main: Read complete after 1s [id=github-workflows:main]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["github-org-collaborators"].module.repository.data.github_branch.main: Read complete after 1s [id=github-org-collaborators:main]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"]: Refreshing state... [id=chef_timezone_iii:limitusus]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_timezone_iii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_autopatch_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Read complete after 3s [id=chef_chef_software:main]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_automate_ha:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_base_config:main]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_artifactory_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_collectd_ii:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_automate_ha:main]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_chef_software:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_autopatch_ii:main]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_config:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_base_role:main]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_collectd_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Read complete after 3s [id=chef_artifactory_ii:main]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-github-repositories]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-private-modules]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwQ84BiWy1]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwe84BiWy6]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwT84BiWy3]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-bjcjq8rHd2mYxoSq]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-cePnVEzzY2MwYRNw]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-mHz65UZ77CqY4nFa]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_default.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_default.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_default.this: Refreshing state... [id=github-org-collaborators]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_default.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_default.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_default.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOJvEX3M4CSnTe]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOBP18Nc4Bh7f_]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOFQgqW84Bh7gA]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwbc4BiWy2]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbdKjM4Bh7f-]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCW9ReM4Bh7gC]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_collectd_ii]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_role]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_default.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_default.this: Refreshing state... [id=chef_automate_ha]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOIhNU984B34HL]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbOQcM4Bh7gD]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # tfe_oauth_client.github will be updated in-place
  ~ resource "tfe_oauth_client" "github" {
        id                  = "oc-My3Z8GgnzemkfQKc"
      ~ oauth_token         = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.chef_cb_repos.module.looper["chef-360"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef-360"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef-360"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef-360"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef-360"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef-360"
    }

  # module.chef_cb_repos.module.looper["chef-360"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef-360"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the 360 Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef-360"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOIhNU984B34HL"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_automate_role"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_automate_role"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_automate_role"
    }

  # module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_automate_role"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the automate_role Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_automate_role"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOHXVhcw"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOHXVheA"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_certificates_config"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_certificates_config"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_certificates_config"
    }

  # module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_certificates_config"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the certificates_config Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_certificates_config"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_chef360_role"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_chef360_role"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_chef360_role"
    }

  # module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_chef360_role"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the chef360_role Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_chef360_role"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_chef_software"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
      ~ enforce_admins                  = false -> true
        id                              = "BPR_kwDOCbOQcM4Bh7gD"
        # (9 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_homeserver_role"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_homeserver_role"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_homeserver_role"
    }

  # module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_homeserver_role"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the homeserver_role Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_homeserver_role"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_nginx_webserver_config"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_nginx_webserver_config"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_nginx_webserver_config"
    }

  # module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_nginx_webserver_config"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the nginx_webserver_config Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_nginx_webserver_config"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_server_role"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_server_role"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_server_role"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_server_role"
    }

  # module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_server_role"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the server_role Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_server_role"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_supermarket_role"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_supermarket_role"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "chef_supermarket_role"
    }

  # module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # module.chef_cb_repos.module.looper["chef_supermarket_role"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Development repository for the supermarket_role Chef Cookbook"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "ChefCookbook"
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "chef_supermarket_role"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "chef",
          + "chef-cookbook",
          + "chef-resource",
          + "managed-by-terraform",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_timezone_iii"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"] will be destroyed
  # (because key ["main"] is not in for_each map)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - repository_id                   = "MDEwOlJlcG9zaXRvcnk4ODY2Mjc4NA==" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [
              - "check",
            ] -> null
          - strict   = true -> null
        }
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_timezone_iii"
        name                        = "chef_timezone_iii"
      ~ vulnerability_alerts        = false -> true
      + web_commit_signoff_required = false
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOBP18Nc4Bh7f_"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOFQgqW84Bh7gA"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef-repo"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOCbdKjM4Bh7f-"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef-repo"
        name                        = "chef-repo"
      ~ vulnerability_alerts        = false -> true
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOJvEX3M4CSnTe"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHWIwbc4BiWy2"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOCW9ReM4Bh7gC"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHWIwT84BiWy3"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module will be updated in-place
  ~ resource "tfe_registry_module" "tf_module" {
        id                   = "mod-mHz65UZ77CqY4nFa"
        name                 = "repositories"
        # (6 unchanged attributes hidden)

      + test_config {}

        # (1 unchanged block hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHWIwe84BiWy6"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module will be updated in-place
  ~ resource "tfe_registry_module" "tf_module" {
        id                   = "mod-bjcjq8rHd2mYxoSq"
        name                 = "private-modules"
        # (6 unchanged attributes hidden)

      + test_config {}

        # (1 unchanged block hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHWIwQ84BiWy1"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module will be updated in-place
  ~ resource "tfe_registry_module" "tf_module" {
        id                   = "mod-cePnVEzzY2MwYRNw"
        name                 = "workspaces"
        # (6 unchanged attributes hidden)

      + test_config {}

        # (1 unchanged block hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHSeHTM4Bh7gF"
        # (10 unchanged attributes hidden)

      + restrict_pushes {
          + blocks_creations = true
        }

        # (2 unchanged blocks hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace will be updated in-place
  ~ resource "tfe_workspace" "workspace" {
        id                             = "ws-sKUnXifAZaTLrKVo"
        name                           = "tf_repo_manager"
        tags                           = {}
      ~ terraform_version              = "latest" -> "1.5.0"
        # (30 unchanged attributes hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace_settings.this will be created
  + resource "tfe_workspace_settings" "this" {
      + agent_pool_id             = (known after apply)
      + assessments_enabled       = false
      + auto_apply                = false
      + description               = "Terraform Github Repository Manager"
      + effective_tags            = (known after apply)
      + execution_mode            = "remote"
      + global_remote_state       = false
      + id                        = (known after apply)
      + overwrites                = (known after apply)
      + remote_state_consumer_ids = (known after apply)
      + tags                      = (known after apply)
      + workspace_id              = "ws-sKUnXifAZaTLrKVo"
    }

Plan: 36 to add, 22 to change, 1 to destroy.


```

</details>

*Pushed by: @Stromweld, Action: `pull_request`*